#include "../walib.h"

void AScript() {
    Init({AICE_SHROOM, AM_ICE_SHROOM, ACHERRY_BOMB, APUFF_SHROOM, ASUN_SHROOM, ASCAREDY_SHROOM, AFLOWER_POT});
    for (int w: {1, 3, 9, 12, 18}) {
        PP(w, 318, 9, {2, 2, 5, 5});
        DD(w, 318 + 110, 9);
        if (w == 9) {
            PP(w, 601 + 318);
        }
    }
    for (int w: {2, 4, 8, 11, 13}) {
        PP(w, 359);
        DD(w, 359 + 107, 7.8125);
    }
    for (int w: {10}) {
        PP(w, 318, 9, {2, 5, 5});
        P(w, 394, 2, 9);
        D(w, 394 + 110, 1, 9);
        D(w, 318 + 110, 5, 9);
    }
    for (int w: {19}) {
        // TODO
        // P(w, 359, 2, 9);
        // D(w, 359 + 107, 1, 7.8125);
        // P(w, 318, 5, 9);
        // D(w, 318 + 107, 5, 9);
        // A(w, 318 + 107 + 107, 5, 9);
        // P(w, 318, 5, 9);
        // D(w, 318 + 107, 5, 9);
    }
    for (int w: {5, 14}) {
        // 分析一下此时的情况
        // 考虑白冰被啃的可能，假设286冰，187白冰变身完成不再怕啃，129扶梯可啃，其他的都啃不到
        // 对一个最快的扶梯，132扶梯实际开啃，到184啃最后一口，一只最快扶梯可啃56血
        // 如果5梯全部齐聚，可啃280血，安全

        // 此时场上w4红眼投掷，全员可对9列举锤，w5白眼投掷，投掷出手耗时212，出手前被下波PP秒掉
        // 先分析常规路和白冰路，因为后续存在砸垫完成后投掷，因此不能对炮举锤
        // 投篮碾压9小喷是272，考虑270下垫
        // w4红270全部举锤，318被冻住，砸垫总时长为208，冻住前完成48，剩160
        // 318+399=717解冻，601+286=887再次被冻，时长170，完成砸垫进度85（48+85=133<142，白冰被护），剩75
        // 887+299=1186解冻，1186+150=1336砸垫完成，1336+211=1547投出小鬼，是当波的1547-1202=345

        // 再分析蓝冰路
        // 对w4红眼，318冰，因此218种下
        // w4红218全部举锤，318被冻住，砸垫总时长为208，冻住前完成100，剩108
        // 318+399=717解冻，601+286=887再次被冻，时长170，完成砸垫进度85，减速投掷进度剩23
        // 887+299=1186解冻，1186+23*2+211=1443投出小鬼，是当波的1443-1202=241，因此要在240及之前激活

        // 再分析不受垫材影响的w5红眼
        // 286冰，286+299=585解冻，585+211=796投掷，也就是当波195

        // 再分析不受垫材影响的w6白眼，是一个常规ice2
        // 286冰，286+399=685解冻，685+211=896投掷，也就是当波295
        
        // 综上所述，常规路要在294及之前激活，蓝冰路在240及之前激活

        // w10要处理蹦极，有一个PSD/PDD 318 318 318 394....
        // 这里则是 240 240 294 294 可以复用

        PP(w, 318);
        MultiTempC(w, 270, { APUFF_SHROOM, ASUN_SHROOM, ASCAREDY_SHROOM }, 9, {2, 5, 6}, 318);
        BlueI(w, 318, 1, 9);
    }
    for (int w: {6, 15}) {
        PP(w, 286);
        WhiteI(w, 286, 2, 9);
    }
    for (int w: {7, 16}) {
        PS(w, 235, 2, 9);
        D(w, 235 + 110, 1, 9);
        PS(w, 290, 5, 9);
        D(w, 290 + 110, 5, 9);
    }
}
