#include "../walib.h"

void AScript() {
    Init({AICE_SHROOM, AM_ICE_SHROOM, ACHERRY_BOMB, APUFF_SHROOM, ASUN_SHROOM, ASCAREDY_SHROOM, AFLOWER_POT});
    for (int w: {1, 3, 9, 12, 18}) {
        PP(w, 249, 9, {2, 2, 5, 5});
        DD(w, 249 + 110, 8.7);
        if (w == 9) {
            PP(w, 601 + 318);
        }
    }
    for (int w: {2, 4, 8, 11, 13, 17}) {
        PP(w, 359);
        DD(w, 359 + 107, 7.8125);
    }
    for (int w: {10}) {
        PP(w, 318, 9, {2, 5, 5});
        P(w, 394, 2, 9);
        D(w, 394 + 110, 1, 9);
        D(w, 318 + 110, 5, 9);
    }
    for (int w: {19}) {
        // TODO
        // P(w, 359, 2, 9);
        // D(w, 359 + 107, 1, 7.8125);
        // P(w, 318, 5, 9);
        // D(w, 318 + 107, 5, 9);
        // A(w, 318 + 107 + 107, 5, 9);
        // P(w, 318, 5, 9);
        // D(w, 318 + 107, 5, 9);
    }
    for (int w: {5, 14}) {
        // 分析一下此时的情况
        // 先假设蓝冰318生效
        // 考虑w4红
        // 考虑蓝冰路，218巨人对蓝冰举锤，318被冻结，717解冻（锤垫-107），919冻结，1218解冻（锤垫-6），+(6+105)*2=1440不投掷，即238激活
        // 考虑其他路，290巨人对垫材举锤，318被冻结，717解冻（锤垫-179），919冻结，1218解冻（锤垫-78），+(78+105)*2=1584不投掷
        // 考虑w5红
        // 318被冻结，717解冻，919冻结，1218解冻（投掷-105），1428投掷，即226激活
        // w10要处理蹦极，有一个PSD/PDD 318 318 318 394....
        // 这里则是 193 193 193 269
        // 无法激活，这里采用的是类似于拦截的方法
        // 会投出的是w9红，delay 212~229
        // 下路第一炮在239生效，最早投出的小鬼最晚1447拦截，即245拦截，第一炮239激活，可以
        // 

        // 1路不能放冰，否则跳跳偷家
        // 6路不能放冰，否则伴舞啃炮

        PP(w, 318);
        MultiTempC(w, 290, { APUFF_SHROOM, ASUN_SHROOM, ASCAREDY_SHROOM }, 9, {1, 5, 6}, 318);
        BlueI(w, 318, 2, 9);
    }
    for (int w: {6, 15}) {
        PP(w, 318);
        WhiteI(w, 318, 5, 9);
    }
    for (int w: {7, 16}) {
        PP(w, 245, 8.6, {2, 2, 5});
        P(w, 263, 5, 8.6);
        D(w, 245 + 115, 1, 9);
        D(w, 263 + 110, 5, 9);
    }
}
