#include "../walib.h"

// 激活用炮对炮质量要求不算很高，因此把单独的3列和4列的炮放进来
ACobManager wind, flat, awind, aflat;

void AScript() {
    Init({
        AICE_SHROOM, AM_ICE_SHROOM, ACOFFEE_BEAN, AFLOWER_POT, ADOOM_SHROOM, 
        ACHERRY_BOMB, AJALAPENO, ASQUASH, AWALL_NUT
    });
    wind.SetList({{2, 1}, {3, 1}, {4, 1}, {5, 1}});
    flat.SetList({{1, 6}, {2, 6}, {3, 6}, {4, 6}});
    awind.SetList({{1, 1}, {1, 3}});
    aflat.SetList({{5, 4}, {5, 6}});
    StartIceFiller({{3, 3}, {3, 4}, {3, 5}});

    // w3只有PDD收冰车，w4I3Pd少收梯子且要防止w2红砸炮，w8缩短支持复用，因此都采用不同冰波长度
    const int i_len = 1895, w3_i_len = 1719, w4_i_len = 1815, w8_i_len = 1823;
    for (int w: {1}) {
        N(w, 360, 3, 8);
        D(w, 359 + 107, 2, 7.825, wind);
        D(w, 359 + 107, 4, 7.825, flat);
    }

    for (int w: {2, 10}) {
        P(w, 546, 2, 8.8125, awind);
        P(w, 546, 4, 8.35, aflat);
        D(w, 546 + 107, 2, 8.65, wind);
        D(w, 546 + 107, 4, 8.1875, flat);
        D(w, 546 + 107 + 131, 2, 8.75, wind);
        D(w, 546 + 107 + 130, 4, 8.7, flat);
    }

    for (int w: {3, 11}) {
        // 延迟到14冰
        I3(w, 14, 746);
        P(w, w3_i_len - 200, 2, 8.3875, awind);
        P(w, w3_i_len - 200, 4, 8.425, aflat);
    }

    for (int w: {4, 12}) {
        // 尾炸收跳跳并支持w1的复用
        I3(w, 11, w3_i_len);
        P(w, 594, 2, 8.625, wind);
        P(w, 594, 4, 8.625, flat);
        d(w, 594 + 335, 2, 4.5875, wind);
        d(w, 594 + 335, 4, 4.5875, flat);
        P(w, w4_i_len - 200, 2, 8.3375, awind);
        P(w, w4_i_len - 200, 4, 8.375, aflat);
    }


    for (int w: WaveList(5, 7) + WaveList(13, 17)) {
        // 一个I3后的白眼，最早解冻11+299=310，收手310+37*2=384，PP可到384+210=594（这就不考虑延迟引信了吧，很多东西都能入场）
        // 接下来考虑拦截，拦截炮炸8.275，delay247，考虑延迟引信给到244
        // 根据seml测试，扶梯最早开啃1720，因此考虑1919连续冰波
        I3(w, 11, w == 5 || w == 13 ? w4_i_len : i_len);
        P(w, 594, 2, 8.625, wind);
        P(w, 594, 4, 8.625, flat);
        D(w, 594 + 229, 2, 8.275, wind);
        D(w, 594 + 227, 4, 8.275, flat);
        // 最左的全伤巨人：1炮伤两行8.2875，3炮伤两行8.275，4/6炮8.325
        P(w, i_len - 200, 2, 8.3, awind);
        P(w, i_len - 200, 4, 8.3375, aflat);
    }

    for (int w: {8, 18}) {
        // 本波I3PD时机提前，波长降低，w9上波激活炮更晚恢复，本波I3PD更早恢复
        I3(w, 11, i_len);
        P(w, 410, 2, 8.75, wind);
        P(w, 410, 4, 8.7, flat);
        D(w, 410 + 215, 2, 8.575, wind);
        D(w, 410 + 215, 4, 8.575, flat);
        P(w, w8_i_len - 200, 2, 8.325, aflat);
        P(w, w8_i_len - 200, 5, 8.2875, awind);
    }

    for (int w: {9, 19}) {
        // 若w8缩短(410I3PD)，则炮恢复时间：1452*2 2062*2 2277*2 3275*2
        I3(w, 11, w8_i_len);
        P(w, 594, 2, 8.625, wind);
        P(w, 594, 4, 8.625, flat);
        D(w, 594 + 229, 2, 8.275, wind);
        D(w, 594 + 227, 4, 8.275, flat);
        // 最左的全伤巨人：1炮伤两行8.2875，3炮伤两行8.275，4/6炮8.325
        // 23路都有核坑，如果只在这两路出怪则存冰可能有损耗，就这样吧
        P(w, i_len - 200, 2, 8.3, awind);
        P(w, i_len - 200, 4, 8.3375, aflat);

        // 炮等效1974激活，2010恢复原速，等效于1992投掷
        N(w, i_len - 200 + 280, 2, 8);

        D(w, 1992 + 133, 2, 8.1375, wind);
        D(w, 1992 + 133, 4, 8.175, flat);

        // 花盆2428恢复，窝瓜2950生效，本波波长3895，少拖了1350
        AConnect(ATime(w, 2500 - RCFT), [w](){
            // 重新实现收尾，防止选择2路
            int rows[6];
            memset(rows, 0, sizeof(rows));
            for (auto &zombie: aAliveZombieFilter) {
                rows[zombie.Row() + 1] += 1;
            }
            int row = -1;
            if (rows[1]) {
                row = 1;
                P(w, 2500, 3, 8.35, flat);
                P(w, 2500, 4, 8.35, wind);
            } else if (rows[5]) {
                row = 5;
                P(w, 2500, 2, 8.35, flat);
                P(w, 2500, 3, 8.35, wind);
            } else if (rows[4]) {
                row = 4;
                P(w, 2500, 2, 8.35, flat);
            }
            if (row < 0) {
                P(w, 2760, 2, 8.35, flat);
            } else {
                TempC(w, 2626, AFLOWER_POT, row, 8, 3860);
                TempC(w, 2626 + 133, ASQUASH, row, 8, 3860);
            }
        });
        
        // 因为拖不了太久放弃
        // // I3PD的D伤本波，可以伤到大部分巨人，因此要分类讨论
        // // 若未伤到全部巨人，则
        // // I3PD：快速：[白]，3血红；慢速：2白，4红
        // // N：快速：[2血红]；慢速：[白]，3红
        // // D：快速：1血红；慢速：白，3红
        // // 11211
        // P(w, i_len - 200, 2, 8.7875, awind);
        // P(w, i_len - 200, 4, 8.325, aflat);
        // // 22322
        // N(w, i_len - 200 + 281, 2, 8);
        // // 22322
        // // 炮等效1999激活，2011恢复原速，等效于2005激活
        // d(w, 2005 + 193, 2, 4.5, wind);
        // d(w, 2005 + 193, 4, 4.5, flat);
        // C(w, 2483, {AFLOWER_POT, AJALAPENO}, 4, 9);
        // C(w, 2584, ACHERRY_BOMB, 4, 9);
        

        // 因撑杆放弃
        // // w8中路红会被创[P]P-I3[PP]-D[D] 命中4次秒杀，不会锤核
        // // 考虑Ndd-A'AD/PDD，2175投掷，之后才可用植物激活，假设2035生效A'，投出小鬼让P拦住
        // C(w, 1050 - CBT - ADT - 751, AFLOWER_POT, 3, 8);
        // N(w, 1050, 3, 8);
        // d(w, 1050 + 330, 2, 4.5, awind);
        // d(w, 1050 + 330, 4, 4.5, aflat);

        // // 半场辣椒激活->樱桃拦截->炮拦截，剩1血红；另半场三炮解决，这样使用花盆最少
        // // 如果两个半场都只有上路红，则省去樱桃拦截即可
        // // 不考虑只有中路有红...
        // TempC(w, 752, AFLOWER_POT, 1, 8, 2180);
        // TempC(w, 1051, ATALL_NUT, 1, 8, 2049);
        // TempC(w, 1600, AFLOWER_POT, 1, 9, 1700);
        // A(w, 2150, 1, 8);
        // A(w, 2150 + 125, 1, 8);
        // D(w, 2150 + 125 + 130, 2, 8, wind);
        // P(w, 2175, 4, 7.7, flat);
        // D(w, 2175 + 126, 4, 8.1375, wind);
        // D(w, 2401, 4, 7.7, flat);
    }
}
